HS.CommonFunding/Connected Services/CommonFundingApi/V-CommonFundingUAT.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://schemas.nevatech.com/services/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" name="V-CommonFundingUAT" targetNamespace="http://schemas.nevatech.com/services/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsp:Policy wsu:Id="CommonFunding_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <wsp:Policy>
            <sp:TransportToken>
              <wsp:Policy>
                <sp:HttpsToken RequireClientCertificate="false">
                </sp:HttpsToken>
              </wsp:Policy>
            </sp:TransportToken>
            <sp:AlgorithmSuite>
              <wsp:Policy>
                <sp:Basic128>
                </sp:Basic128>
              </wsp:Policy>
            </sp:AlgorithmSuite>
            <sp:Layout>
              <wsp:Policy>
                <sp:Lax>
                </sp:Lax>
              </wsp:Policy>
            </sp:Layout>
            <sp:IncludeTimestamp>
            </sp:IncludeTimestamp>
          </wsp:Policy>
        </sp:TransportBinding>
        <sp:SignedSupportingTokens xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <wsp:Policy>
            <sp:UsernameToken sp:IncludeToken="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy/IncludeToken/AlwaysToRecipient">
              <wsp:Policy>
                <sp:WssUsernameToken10>
                </sp:WssUsernameToken10>
              </wsp:Policy>
            </sp:UsernameToken>
          </wsp:Policy>
        </sp:SignedSupportingTokens>
        <sp:Wss11 xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <wsp:Policy>
          </wsp:Policy>
        </sp:Wss11>
        <sp:Trust10 xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <wsp:Policy>
            <sp:MustSupportIssuedTokens>
            </sp:MustSupportIssuedTokens>
            <sp:RequireClientEntropy>
            </sp:RequireClientEntropy>
            <sp:RequireServerEntropy>
            </sp:RequireServerEntropy>
          </wsp:Policy>
        </sp:Trust10>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsdl:types>
    <xs:schema xmlns:tns="http://tempuri.org/" elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:import namespace="http://schemas.datacontract.org/2004/07/Service.CommonFunding" />
      <xs:element name="APIVersion">
        <xs:complexType>
          <xs:sequence />
        </xs:complexType>
      </xs:element>
      <xs:element name="APIVersionResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="APIVersionResult" nillable="true" type="xs:string" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="UpsertCommonFundingDataFromThirdPartyCRM">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="ApplicationID" type="xs:int" />
            <xs:element minOccurs="0" name="Username" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="Password" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="CSNumber" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="ContractID" type="xs:int" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="UpsertCommonFundingDataFromThirdPartyCRMResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q1="http://schemas.datacontract.org/2004/07/Service.CommonFunding" minOccurs="0" name="UpsertCommonFundingDataFromThirdPartyCRMResult" nillable="true" type="q1:CommonFundingDataResults" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:element name="anyType" nillable="true" type="xs:anyType" />
      <xs:element name="anyURI" nillable="true" type="xs:anyURI" />
      <xs:element name="base64Binary" nillable="true" type="xs:base64Binary" />
      <xs:element name="boolean" nillable="true" type="xs:boolean" />
      <xs:element name="byte" nillable="true" type="xs:byte" />
      <xs:element name="dateTime" nillable="true" type="xs:dateTime" />
      <xs:element name="decimal" nillable="true" type="xs:decimal" />
      <xs:element name="double" nillable="true" type="xs:double" />
      <xs:element name="float" nillable="true" type="xs:float" />
      <xs:element name="int" nillable="true" type="xs:int" />
      <xs:element name="long" nillable="true" type="xs:long" />
      <xs:element name="QName" nillable="true" type="xs:QName" />
      <xs:element name="short" nillable="true" type="xs:short" />
      <xs:element name="string" nillable="true" type="xs:string" />
      <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte" />
      <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt" />
      <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong" />
      <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort" />
      <xs:element name="char" nillable="true" type="tns:char" />
      <xs:simpleType name="char">
        <xs:restriction base="xs:int" />
      </xs:simpleType>
      <xs:element name="duration" nillable="true" type="tns:duration" />
      <xs:simpleType name="duration">
        <xs:restriction base="xs:duration">
          <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?" />
          <xs:minInclusive value="-P10675199DT2H48M5.4775808S" />
          <xs:maxInclusive value="P10675199DT2H48M5.4775807S" />
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="guid" nillable="true" type="tns:guid" />
      <xs:simpleType name="guid">
        <xs:restriction base="xs:string">
          <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}" />
        </xs:restriction>
      </xs:simpleType>
      <xs:attribute name="FactoryType" type="xs:QName" />
      <xs:attribute name="Id" type="xs:ID" />
      <xs:attribute name="Ref" type="xs:IDREF" />
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.datacontract.org/2004/07/Service.CommonFunding" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Service.CommonFunding" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:complexType name="CommonFundingDataResults">
        <xs:sequence>
          <xs:element minOccurs="0" name="FailureCode" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="Success" type="xs:boolean" />
          <xs:element minOccurs="0" name="SuccessMessage" nillable="true" type="xs:string" />
        </xs:sequence>
      </xs:complexType>
      <xs:element name="CommonFundingDataResults" nillable="true" type="tns:CommonFundingDataResults" />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="IVirtualInterface_APIVersion_InputMessage">
    <wsdl:part xmlns:q1="http://tempuri.org/" name="parameters" element="q1:APIVersion" />
  </wsdl:message>
  <wsdl:message name="IVirtualInterface_APIVersion_OutputMessage">
    <wsdl:part xmlns:q2="http://tempuri.org/" name="parameters" element="q2:APIVersionResponse" />
  </wsdl:message>
  <wsdl:message name="IVirtualInterface_UpsertCommonFundingDataFromThirdPartyCRM_InputMessage">
    <wsdl:part xmlns:q3="http://tempuri.org/" name="parameters" element="q3:UpsertCommonFundingDataFromThirdPartyCRM" />
  </wsdl:message>
  <wsdl:message name="IVirtualInterface_UpsertCommonFundingDataFromThirdPartyCRM_OutputMessage">
    <wsdl:part xmlns:q4="http://tempuri.org/" name="parameters" element="q4:UpsertCommonFundingDataFromThirdPartyCRMResponse" />
  </wsdl:message>
  <wsdl:portType name="IVirtualInterface">
    <wsdl:operation name="APIVersion">
      <wsdl:input wsaw:Action="http://tempuri.org/ICommonFunding/APIVersion" message="tns:IVirtualInterface_APIVersion_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/ICommonFunding/APIVersionResponse" message="tns:IVirtualInterface_APIVersion_OutputMessage" />
    </wsdl:operation>
    <wsdl:operation name="UpsertCommonFundingDataFromThirdPartyCRM">
      <wsdl:input wsaw:Action="http://tempuri.org/ICommonFunding/UpsertCommonFundingDataFromThirdPartyCRM" message="tns:IVirtualInterface_UpsertCommonFundingDataFromThirdPartyCRM_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/ICommonFunding/UpsertCommonFundingDataFromThirdPartyCRMResponse" message="tns:IVirtualInterface_UpsertCommonFundingDataFromThirdPartyCRM_OutputMessage" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="CommonFunding" type="tns:IVirtualInterface">
    <wsp:PolicyReference URI="#CommonFunding_policy">
    </wsp:PolicyReference>
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="APIVersion">
      <soap:operation soapAction="http://tempuri.org/ICommonFunding/APIVersion" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="UpsertCommonFundingDataFromThirdPartyCRM">
      <soap:operation soapAction="http://tempuri.org/ICommonFunding/UpsertCommonFundingDataFromThirdPartyCRM" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="V-CommonFundingUAT">
    <wsdl:port name="CommonFunding" binding="tns:CommonFunding">
      <soap:address location="https://senti.monitronics.net/CommonFundingUAT" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>